app/helpers/categories_helper.rb

  def category_expense(categories)
    expenses_by_category = []
    categories.each do |category|
      total_category_expense = 0
      expense_categories = ExpenseCategory.where(category_id: category.id)
      expense_categories.each do |expense_category|
        expense = Expense.find(expense_category.expense_id)
---
SELECT "expense_categories".* FROM "expense_categories" WHERE "expense_categories"."category_id" = $1  [["category_id", 7]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]