app/helpers/expenses_helper.rb

  def create_expense(expense, category_ids)
    categories = []
    category_ids.each_with_index do |category_id, idx|
      categories << category_id unless idx.zero?
    end

    expense.transaction do
      categories.each do |category_id|
        @category = Category.find(category_id)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def category_expenses(category_id)
    @expense_categories = ExpenseCategory.includes(:expense).where(category_id:).order(created_at: :desc)
    @expense_categories.map(&:expense)
---
SELECT "expense_categories".* FROM "expense_categories" WHERE "expense_categories"."category_id" = $1 ORDER BY "expense_categories"."created_at" DESC  [["category_id", 8]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" IN ($1, $2)  [["id", 55], ["id", 54]]