app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."author_id" = $1  [["author_id", 1]]
---
  def index
    @categories = Category.where(author: current_user)

INSERT INTO "categories" ("name", "icon", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Food"], ["icon", "fffffffffffffffffffff"], ["author_id", 1], ["created_at", "2022-12-21 14:09:06.185058"], ["updated_at", "2022-12-21 14:09:06.185058"]]
---
  def create
    @category = Category.new(category_params)

    if @category.save