app/controllers/expenses_controller.rb

SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @expense = Expense.find(params[:id])

SELECT "categories".* FROM "categories" WHERE "categories"."author_id" = $1  [["author_id", 1]]
---
  def new
    @expense = Expense.new
    @categories = Category.where(author: current_user)

INSERT INTO "expenses" ("name", "amount", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Cooking"], ["amount", "2.0"], ["author_id", 2], ["created_at", "2022-12-21 10:00:34.354831"], ["updated_at", "2022-12-21 10:00:34.354831"]]
---
  def create
    @expense = Expense.new(expense_params)
    @prev_category = Category.where(params[:expense][:prev_category_id])
    create_expense(@expense, params[:category][:category_id])

    if @expense.save