app/models/expense_category.rb

  def self.save_category(category, expense)
    @expense_category = ExpenseCategory.new(category:, expense:)
    return true if @expense_category.save
---
INSERT INTO "expense_categories" ("category_id", "expense_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category_id", 8], ["expense_id", 52], ["created_at", "2022-12-21 11:22:23.805206"], ["updated_at", "2022-12-21 11:22:23.805206"]]
INSERT INTO "expenses" ("name", "amount", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "EXpence 2"], ["amount", "2.0"], ["author_id", 2], ["created_at", "2022-12-21 11:22:23.791176"], ["updated_at", "2022-12-21 11:22:23.791176"]]