app/views/expenses/new.html.erb

SELECT "categories".* FROM "categories"
---
        <%= f.label :select_categories %>
        <%= select("category",
          "category_id",
          @categories.each.collect { |c| [ c.name, c.id ] },
          { include_blank: false },
          multiple: true,
          size: 5,
          class: "form-control p-1",
          required: true) %>